<template>
<div :style="currentStyle">
  <div v-if="articleIndex === 0">
    <h2>自定义键盘快捷键</h2>
    <hr />
    <p>通过将键盘快捷方式（或快捷键）指定给命令、宏、字体、样式或常用符号，可以自定义键盘快捷键。也可以删除键盘快捷键。</p>
    <h2>使用键盘指定或删除键盘快捷键</h2>
    <hr />
    <ol>
      <li>如有必要，按 Alt+F 和 T 打开“Word 选项”对话框，然后按向下键选择“自定义功能区”。</li>
      <li>重复按 Tab 键直到选中“自定义”，然后按 Enter。</li>
      <li>在“类别”框中，按向下键或向上键，选择其中包含要为其指定键盘快捷键或删除其键盘快捷键的命令或其他项目的类别。</li>
      <li>按 Tab 键移至“命令”框。</li>
      <li>按向下键或向上键选择要为其指定键盘快捷键或删除其键盘快捷键的命令或其他项目的名称。
        当前指定给该命令或项的所有键盘快捷键都将显示在“当前快捷键”框中。</li>
      <li>请执行下列操作之一：</li>
      <div>
        <p>指定键盘快捷键</p>
        <p>以 Ctrl 或功能键开始键盘快捷键。 </p>
        <ol>
          <li>重复按 Tab 键直到光标位于“请按新快捷键”框中。</li>
          <li>按要指定的键击组合。例如，同时按 Ctrl 和要使用的键。</li>
          <li>查看“目前指定到”的内容以确定该键击组合是否已指定给某一命令或其他项。如果已经指定该组合，请键入其他组合。</li>
          <li>重复按 Tab 键直到选中“将更改保存在”框。</li>
          <li>按向下键或向上键突出显示当前文档名或要在其中保存键盘快捷键更改的模板，然后按 Enter。</li>
          <li>重复按 Tab 键直到选中“指定”，然后按 Enter。</li>
        </ol>
        <p>删除键盘快捷方式</p>
        <ol>
          <li>重复按 Tab 键直到选中“将更改保存在”框。
          </li>
          <li>
            按向下键或向上键突出显示当前文档名或要在其中保存键盘快捷键更改的模板，然后按 Enter。
          </li>
          <li>
            重复按 SHIFT+TAB 键直到光标位于“当前快捷键”框中。
          </li>
          <li>
            按向下键或向上键选择要删除的键盘快捷键。
          </li>
          <li>
            重复按 Tab 键直到选中“删除”，然后按 Enter。
          </li>
        </ol>
      </div>
    </ol>
    <h2>使用键盘指定或删除键盘快捷键</h2>
    <hr />
    <ol>
      <li>如有必要，单击“文件”选项卡，单击“选项”，再单击“自定义功能区”选项卡。</li>
      <li>在“自定义功能区和键盘快捷键”窗格中，单击“自定义”。</li>
      <li>在“将更改保存在”框中，单击当前文档名或要在其中保存键盘快捷键更改的模板。</li>
      <li>在“类别”框中，单击其中包含要为其指定键盘快捷键或删除其键盘快捷键的命令或其他项的类别。</li>
      <li>在“命令”框中，单击要为其指定键盘快捷键或删除其键盘快捷键的命令或其他项的名称。</li>
      <li>请执行下列操作之一：</li>
      <div>
        <p>指定键盘快捷键</p>
        <p>以 Ctrl 或功能键开始键盘快捷键。 </p>
        <ol>
          <li>在“请按新快捷键”框中，按要指定的键击组合。例如，同时按 Ctrl 和要使用的键。</li>
          <li>查看“目前指定到”的内容以确定该键击组合是否已指定给某一命令或其他项。如果已经指定该组合，请键入其他组合。</li>
          <li>单击“指定”。</li>
        </ol>
        <p>删除键盘快捷方式</p>
        <ol>
          <li>在“当前快捷键”框中，单击要删除的键盘快捷键。
          </li>
          <li>
            单击“删除”。
          </li>
        </ol>
      </div>
    </ol>
  </div>


  <div v-if="articleIndex === 1">

    <h2>关闭推荐的更新和诊断设置</h2>
    <hr />
    <p>Microsoft Office 2010 安装完毕后，系统将请求您选择 Microsoft 服务（例如重要产品更新和 Office 诊断）的参与级别。您可以随时更改设置。</p>
    <h2>了解有关每个选项的详细信息</h2>
    <hr />
    <p>使用推荐的设置</p>
    <p><b>Windows Vista 和 Windows 7 </b> 选择此设置可以启用 Microsoft 更新服务和自动更新。将会为 Office 和其他 Microsoft
      软件自动安装重要及推荐的更新。重要更新可提供重要好处，例如可以更好地防御安全或隐私威胁。它们还可以提高计算机和软件的可靠性。如果您的软件连接到联机服务，可能会根据需要安装重要更新以便您能够访问联机服务。推荐的更新可解决非关键性问题，并帮助增强您的计算体验。系统还可能会向您提供新的可选的
      Office 和 Microsoft 软件。不会自动安装新软件。
    </p>
    <p>仅安装更新</p>
    <p><b>Windows Vista 和 Windows 7 </b> 选择此设置可以启用 Microsoft 更新服务和自动更新。将会为 Office 和其他 Microsoft
      软件自动安装重要及推荐的更新。重要更新可提供重要好处，例如可以更好地防御安全或隐私威胁。它们还可以提高计算机和软件的可靠性。如果您的软件连接到联机服务，可能会根据需要安装重要更新以便您能够访问联机服务。推荐的更新可解决非关键性问题，并帮助增强您的计算体验。系统还可能会向您提供新的可选的
      Office 和 Microsoft 软件。不会自动安装新软件。
    </p>
    <p>请勿更改</p>
    <p>如果选择此设置，系统不会向您的计算机自动下载任何更新，“Office 诊断”也无法确定和解决您安装的 Office 程序的问题，并且 Microsoft 不会收集任何信息来帮助改进 Office。
    </p>
    <h2>更改设置</h2>
    <hr />
    <p>更改 WINDOWS UPDATE 设置</p>
    <p>有关 Microsoft Update 的详细信息，请参阅使用 Microsoft Update 更新计算机。</p>
    <p>如果您使用的是 Windows 7</p>
    <ol>
      <li>单击“开始”，然后单击“控制面板” </li>
      <li>单击“系统和安全性”，然后单击“Windows Update”。</li>
      <li>单击“更改设置”。</li>
      <li>选择您的设置，然后单击“确定”。</li>
    </ol>
    <p>如果您使用的是 Windows Vista</p>
    <ol>
      <li>单击“开始”，然后单击“控制面板” </li>
      <li>在“安全性”下，单击“检查更新”，然后单击“更改设置”。</li>
      <li>选择您的设置，然后单击“确定”。</li>
    </ol>
    <p>如果您使用的是 Windows XP</p>
    <ol>
      <li>请访问 Microsoft Update 网站。 </li>
      <li>单击“更改设置”。</li>
      <li>在“停止使用 Microsoft Update”下，选中“禁用 Microsoft Update 软件，只允许我使用 Windows Update”复选框。
      </li>
      <li>单击“立即应用更改”，然后单击“是”。</li>
    </ol>
    <p>更改“隐私选项”设置</p>
    <ol>
      <li>单击“文件”选项卡。此时将出现“Microsoft Office Backstage 视图”。 </li>
      <li>在“帮助”下，单击“选项”。</li>
      <li>单击“信任中心”，再单击“信任中心设置”，然后单击“隐私选项”。</li>
      <li>选中或清除要更改的设置的复选框。</li>
      <li>单击“确定”。</li>
    </ol>
  </div>


  <div v-if="articleIndex === 2">
    <h2>对宏项目进行数字签名</h2>
    <hr />
    <p>本文介绍如何使用证书对宏项目进行数字签名。如果您还没有数字证书，则必须获取一个数字证书。若要在您自己的计算机上测试宏项目，可以使用 Selfcert.exe 工具创建自己的自签名证书。</p>
    <h2>获取用于签名的数字证书</h2>
    <hr />
    <p>可以从商业证书颁发机构 (CA) 获得数字证书，也可以从内部安全管理员或信息技术 (IT) 专业人员那里获得数字证书。</p>
    <p>若要了解为 Microsoft 产品提供服务的证书颁发机构的详细信息，请参阅 Microsoft 根证书计划成员列表。</p>
    <h2>宏项目和 Microsoft Office</h2>
    <hr />
    <p>由于您创建的数字证书不是由正规的可信证书颁发机构颁发的，因此使用此类证书进行签名的宏项目称为自签名项目。只有在将自签名证书添加到“证书 - 当前用户”存储区中的“受信任根证书”文件夹 （英文）的计算机上，Microsoft
      Office 才信任该证书。</p>
    <p>若要了解如何创建自签名证书，请参阅下面一节。</p>

    <p>创建自签名证书</p>
    <p>WINDOWS VISTA</p>
    <ol>
      <li>单击“开始”按钮，指向“所有程序”，依次单击“Microsoft Office”、“Microsoft Office 工具”和“VBA 项目的数字证书”。 </li>
      <li>此时将显示“创建数字证书”对话框。 </li>
      <li>在“您的证书名称”框中，为证书键入一个描述性名称。</li>
      <li>单击“确定”。 </li>
      <li>在出现“SelfCert 成功”消息时，单击“确定”。</li>
    </ol>

    <p>查看证书</p>
    <p>若要查看个人证书存储中的证书，请执行下列操作：</p>
    <ol>
      <li>打开 Windows Internet Explorer。 </li>
      <li>在“工具”菜单上，单击“Internet 选项”，然后单击“内容”选项卡。 </li>
      <li>单击“证书”，然后单击“个人”选项卡。</li>
    </ol>

    <p>WINDOWS XP 和 WINDOWS 7</p>
    <ol>
      <li>单击“开始”按钮，指向“所有程序”，依次单击“Microsoft Office”、“Microsoft Office 工具”和“VBA 项目的数字证书”。 </li>
      <li>此时将显示“创建数字证书”对话框。 </li>
      <li>在“您的证书名称”框中，为证书键入一个描述性名称。</li>
      <li>单击“确定”。 </li>
      <li>在出现“SelfCert 成功”消息时，单击“确定”。</li>
    </ol>

    <p>查看证书</p>
    <p>若要查看个人证书存储中的证书，请执行下列操作：</p>
    <ol>
      <li>打开 Windows Internet Explorer。 </li>
      <li>在“工具”菜单上，单击“Internet 选项”，然后单击“内容”选项卡。 </li>
      <li>单击“证书”，然后单击“个人”选项卡。</li>
    </ol>

    <h2>对 Excel、PowerPoint、Publisher、Visio 或 Word 中的宏项目进行数字签名</h2>
    <hr />
    <ol>
      <li>打开包含要对其进行签名的宏项目的文件。</li>
      <li>在“开发工具”选项卡上的“代码”组中，单击“Visual Basic”。 </li>
      <p>如果未显示“开发工具”选项卡，请单击“文件”选项卡。此时将显示“Microsoft Office Backstage
        视图”。在“帮助”下，单击“选项”。单击“自定义功能区”。在“自定义功能区”列表中，选择“开发工具”，然后单击“确定”</p>
      <li>在 Visual Basic 中的“工具”菜单上，单击“数字签名”。</li>
      <li>将出现“数字签名”对话框。 </li>
      <li>选择一个证书，然后单击“确定”。</li>
      <p>如果尚未选择数字证书或者要使用其他证书，请单击“选择”。选择一个证书，然后单击“确定”。</p>
    </ol>
  </div>


  <div v-if="articleIndex === 3">

    <h2>自定义功能区</h2>
    <hr />
    <p>使用自定义设置根据需要对属于 Microsoft Office Fluent 用户界面一部分的功能区进行个性化设置。例如，可以创建自定义选项卡和自定义组来包含您的常用命令。</p>
    <p>尽管您可以向自定义组添加命令，但无法更改 Microsoft Office 2010 中内置的默认选项卡和组。默认组上的命令不可用或处于灰显状态，因此无法对其进行编辑。</p>
    <p>在“自定义功能区”列表中，自定义选项卡和组的名称后面带有 (自定义) 字样，但 (自定义) 这几个字不会显示在功能区中。</p>
    <h2>添加自定义选项卡和自定义组</h2>
    <hr />
    <p>单击“新建选项卡”可添加自定义选项卡和自定义组。只能向自定义组中添加命令。</p>
    <ol>
      <li>单击“文件”选项卡。 </li>
      <li>在“帮助”下，单击“选项”。 </li>
      <li>单击“自定义功能区”。</li>
      <li>单击“新建选项卡”。 </li>
      <li>若要查看和保存自定义设置，请单击“确定”。</li>
    </ol>
    <p>若要向组中添加命令，请参阅向组中添加命令一节。</p>

    <h2>重命名选项卡或组</h2>
    <hr />
    <ol>
      <li>在“自定义功能区”窗口中的“自定义功能区”列表下，单击要重命名的选项卡或组。 </li>
      <p>如何到达“自定义功能区”窗口？</p>
      <ol>
        <li>单击“文件”选项卡。 </li>
        <li>在“帮助”下，单击“选项”。 </li>
        <li>单击“自定义功能区”。</li>
      </ol>
      <li>单击“重命名”，然后键入新名称。 </li>
      <p>重命名自定义组时，也可以单击表示该组的图标。</p>
      <li>若要查看和保存自定义设置，请单击“确定”。</li>
    </ol>
    <h2>向选项卡中添加自定义组</h2>
    <hr />
    <p>您可以向自定义选项卡或默认选项卡中添加自定义组。</p>
    <ol>
      <li>在“自定义功能区”窗口中的“自定义功能区”列表下，单击要向其中添加组的选项卡。 </li>
      <p>如何到达“自定义功能区”窗口？</p>
      <ol>
        <li>单击“文件”选项卡。 </li>
        <li>在“帮助”下，单击“选项”。 </li>
        <li>单击“自定义功能区”。</li>
      </ol>
      <li>单击“新建组”。 </li>
      <li>若要重命名“新建组(自定义)”组，请右键单击该组，单击“重命名”，然后键入新名称。 </li>
      <li>若要隐藏您添加到此自定义组中的命令的标签，请右键单击该组，然后单击“隐藏命令标签”。</li>
      <p>若要在隐藏自定义组中命令的标签后查看这些标签，请右键单击该组，然后单击“隐藏命令标签”。</p>
      <li>若要查看和保存自定义设置，请单击“确定”。 </li>
    </ol>
    <h2>隐藏选项卡</h2>
    <hr />
    <p>您可以隐藏自定义和默认选项卡，但只能删除自定义选项卡。</p>
    <ol>
      <li>在“自定义功能区”窗口中的“自定义功能区”列表下，清除要隐藏的默认选项卡或自定义选项卡旁的复选框。</li>
      <p>如何到达“自定义功能区”窗口？</p>
      <ol>
        <li>单击“文件”选项卡。 </li>
        <li>在“帮助”下，单击“选项”。 </li>
        <li>单击“自定义功能区”。</li>
      </ol>
      <li>若要查看和保存自定义设置，请单击“确定”。 </li>
    </ol>
  </div>


  <div v-if="articleIndex === 4">
    <h2>为什么加载项出现故障？</h2>
    <hr />
    <p>Microsoft Office 2010 新增了一项安全功能：数据执行保护 (DEP)。该功能可防止运行可能会损害计算机的编写拙劣的代码。如果不适合在启用 DEP 的环境中工作的加载项试图运行，您所使用的 Office
      程序就会停止工作（崩溃），并在重新启动后显示一条错误消息。</p>
    <h2>加载项是否已被数据执行保护禁用？</h2>
    <hr />
    <p>在“加载项”区域中，可以选择您要了解的加载项。有关该加载项的信息会显示在“说明”区域中。如果加载项已被数据执行保护禁用，则其说明会指出这一点。此外，也可以在此区域中启用该加载项。若要确定加载项的状态，请按以下说明操作。</p>
    <ol>
      <li>单击“文件”选项卡。此时将显示“Microsoft Office Backstage 视图”。</li>
      <li>在“帮助”下，单击“选项”。此时将显示“选项”对话框。</li>
      <li>单击“加载项”。此时将显示“加载项”对话框。</li>
    </ol>
    <p>可以在加载项列表中上移和下移指针。在“说明”区域中，可以了解有关每个加载项的详细信息；例如，加载项是否被 DEP 禁止等。按照以下说明操作，确定 DEP 说明的实质。</p>
    <ul>
      <li>加载项与数据执行保护不兼容 加载项未能通过 DEP 进程，因而被禁用。</li>
      <li>用户在数据执行保护失败后禁用加载项：用户在出现错误后禁用了加载项。</li>
    </ul>
    <p>32 位和 64 位版本的 Office 2010 均提供了数据执行保护。32 位版本提供了可供您查看或更改的“信任中心”选项，而 64 位版本未提供“信任中心”选项。</p>

    <h2>打开或关闭数据执行保护</h2>
    <hr />
    <p>您可以在信任中心中打开或关闭数据执行保护。</p>
    <p> 如果关闭数据执行保护，计算机将容易出现风险和受到损坏。建议您不要关闭此功能。</p>
    <ol>
      <li>单击“文件”选项卡。此时将显示“Backstage 视图”。</li>
      <li>在“帮助”下，单击“选项”。此时将显示“选项”对话框。</li>
      <li>单击“信任中心”，然后单击“信任中心设置”。</li>
      <li>在“信任中心”下，单击“受保护的视图”。</li>
      <li>在“数据执行保护”下，选中或清除“启用数据执行保护模式”。</li>
    </ol>
    <p>32 位和 64 位版本的 Office 2010 均提供了数据执行保护。32 位版本提供了可供您查看或更改的“信任中心”选项，而 64 位版本未提供“信任中心”选项。</p>

    <p> 在 Office 2010 程序中查看“加载项”区域</p>
    <ol>
      <li>单击“文件”选项卡。此时将显示“Microsoft Office Backstage 视图”。</li>
      <li>在“帮助”下，单击“选项”。此时将显示“选项”对话框。</li>
      <li>单击“加载项”。此时将显示“加载项”区域。</li>
    </ol>
    <p>可以在加载项列表中上移和下移指针。在“说明”区域中，可以了解有关每个加载项的详细信息；例如，加载项是否被数据执行保护错误禁止等。 </p>
  </div>


  <div v-if="articleIndex === 5">

    <h2>启用自动语言选项</h2>
    <hr />
    <p>黎先生在加拿大工作，他定期与在西班牙和法国的家人通信。当他使用多种语言键入和编辑文字时，可以使用以下两种自动语言功能更轻松地在语言间切换：“自动检测语言”和“自动切换键盘以匹配周围文字的语言”。</p>
    <h2>自动检测语言</h2>
    <hr />
    <p>“自动检测语言”功能可检测到黎先生正在键入的语言，并启用该语言的校对工具。其结果与他手动设置语言的结果是相同的。“自动检测语言”功能仅在以下 Office 2010 程序中可用：Outlook 和 Word。</p>
    <p>在 WORD 或 OUTLOOK 中检测语言</p>
    <ol>
      <li>打开一个新文档或电子邮件。</li>
      <li>在“审阅”选项卡的“语言”组中，单击“语言”下的箭头。</li>
      <li>单击“设置校对语言”。 </li>
      <li>在“语言”对话框中，选中“自动检测语言”复选框。</li>
      <li>检查“将所选文字标为”列表中显示在双线上方的语言。Office 只能检测到双线上方列出的语言。如果您所用的语言未显示在双线上方，则必须启用编辑语言（启用语言特定的选项），让 Office 自动检测到这些语言。</li>
    </ol>
    <h2>自动切换键盘以匹配周围文字的语言</h2>
    <hr />
    <p>由于黎先生使用三种基于拉丁语的语言，因而他使用“自动切换键盘以匹配周围文字的语言”选项，将键盘语言更改为与文件中的周围文本相匹配。</p>
    <p>“自动切换键盘以匹配周围文字的语言”选项仅在以下 Office 2010 程序中可用：OneNote、Outlook、PowerPoint、Publisher 和 Word。</p>
    <p>
      启用“自动切换键盘以匹配周围文字的语言”选项后，该选项会将键盘的布局更改为与光标位置相邻的文字语言相匹配的语言。例如，如果黎先生的文件中所包含的段落同时使用了英语和西班牙语，他将光标从英语段落移至西班牙语段落时，键盘布局会随之从“英语”切换为“西班牙语”。这与黎先生使用“语言”栏手动将键盘布局从“英语”切换为“西班牙语”的效果是一样的。
    </p>
    <p>ONENOTE</p>
    <ol>
      <li>在 Outlook 或电子邮件中单击“文件”选项卡。</li>
      <li>在“帮助”下，单击“选项”。</li>
      <li>单击“邮件”。 </li>
      <li>单击“编辑器选项”。</li>
      <li>单击“高级”。</li>
      <li>在“编辑选项”下，选中“自动切换键盘以匹配周围文字的语言”复选框。</li>
      <p>仅当您启用某种语言的键盘布局后，“自动切换键盘以匹配周围文字的语言”复选框才可见。如果您看不到该选项，则需针对您要使用的语言启用键盘布局。</p>
    </ol>
    <p>PowerPoint</p>
    <ol>
      <li>单击“文件”选项卡。</li>
      <li>在“帮助”下，单击“选项”。</li>
      <li>单击“高级”。 </li>
      <li>在“编辑选项”下，选中“自动切换键盘以匹配周围文字的语言”复选框。</li>
      <p>仅当您启用某种语言的键盘布局后，“自动切换键盘以匹配周围文字的语言”复选框才可见。如果您看不到该选项，则需针对您要使用的语言启用键盘布局。</p>
    </ol>
    <p>Word</p>
    <ol>
      <li>单击“文件”选项卡。</li>
      <li>在“帮助”下，单击“选项”。</li>
      <li>单击“高级”。 </li>
      <li>在“编辑选项”下，选中“自动切换键盘以匹配周围文字的语言”复选框。</li>
      <p>仅当您启用某种语言的键盘布局后，“自动切换键盘以匹配周围文字的语言”复选框才可见。如果您看不到该选项，则需针对您要使用的语言启用键盘布局。</p>
    </ol>
  </div>


  <div v-if="articleIndex === 6">
    <h2>更改图片颜色、透明度或对图片重新着色</h2>
    <hr />
    <p>您可以调整图片的颜色浓度（饱和度）和色调（色温）、对图片重新着色或者更改图片中某个颜色的透明度。可以将多个颜色效果应用于图片。</p>
    <h2>更改图片的颜色浓度</h2>
    <hr />
    <p>饱和度是颜色的浓度。饱和度越高，图片色彩越鲜艳；饱和度越低，图片越黯淡。</p>
    <ol>
      <li>单击要为其更改颜色浓度的图片。 </li>
      <li>在“图片工具”下，“格式”选项卡上的“调整”组中，单击“颜色”。</li>
      <p>如果没有看到“格式”或“图片工具”选项卡，请确保选择了图片。您可能必须双击图片才能选择它并打开“格式”选项卡。</p>
      <li>若要选择其中一个最常用的“颜色饱和度”调整，请单击“预设”，然后单击所需的缩略图。 </li>
      <p>您可以将鼠标指针移至任何效果上，并使用“实时预览”查看在应用该效果后图片的外观，然后再单击所需的效果。</p>
      <li>若要微调浓度，请单击“图片颜色选项”。</li>
    </ol>
    <h2>更改图片的色调</h2>
    <hr />
    <p>当相机未正确测量色温时，图片上会显示色偏（一种颜色支配图片过多的情况），这使得图片看上去偏蓝或偏橙。您可以通过提高或降低色温从而增强图片的细节来调整这种状况，并使图片看上去更好看。</p>
    <ol>
      <li>单击要为其更改色调的图片。</li>
      <li>在“图片工具”下，“格式”选项卡上的“调整”组中，单击“颜色”。</li>
      <p>如果没有看到“格式”或“图片工具”选项卡，请确保选择了图片。您可能必须双击图片才能选择它并打开“格式”选项卡。</p>
      <li>若要选择其中一个最常用的“色调”调整，请单击“预设”，然后单击所需的缩略图</li>
      <p>您可以将鼠标指针移至任何效果上，并使用“实时预览”查看在应用该效果后图片的外观，然后再单击所需的效果。</p>
      <li>若要微调浓度，请单击“图片颜色选项”。</li>
      <p>有关这些选项的其他帮助，请参阅设置图片格式（“图片颜色”窗格）。</p>
    </ol>
    <h2>图片重新着色</h2>
    <hr />
    <p>您可以将一种内置的风格效果（如灰度或褐色色调）快速应用于图片。 </p>
    <ol>
      <li>单击要重新着色的图片。</li>
      <li>在“图片工具”下，“格式”选项卡上的“调整”组中，单击“颜色”。</li>
      <p>如果没有看到“格式”或“图片工具”选项卡，请确保选择了图片。您可能必须双击图片才能选择它并打开“格式”选项卡。</p>
      <li>若要选择其中一个最常用的“重新着色”调整，请单击“预设”，然后单击所需的缩略图。 </li>
      <p>您可以将鼠标指针移至任何效果上，并使用“实时预览”查看在应用该效果后图片的外观，然后再单击所需的效果。</p>
      <li>若要使用更多的颜色，包括主题颜色 （主题颜色：文件中使用的颜色的集合。主题颜色、主题字体和主题效果三者构成一个主题。）的变体、“标准”选项卡上的颜色或自定义颜色，请单击“其他变体”。将应用使用颜色变体的重新着色效果。
      </li>
      <p>若要删除重新着色效果，但保留对图片所做的任何其他更改，请单击第一个效果“不重新着色”。 </p>
    </ol>
  </div>


  <div v-if="articleIndex === 7">
    <h2>设置编辑、界面或帮助语言首选项</h2>
    <hr />
    <p>在“设置 Office 语言首选项”对话框中，可以更改编辑、界面、屏幕提示和帮助所用的语言，使之使用不同语言。具体哪些语言可用则取决于 Microsoft Office 2010
      的语言版本，以及计算机上安装的任何附加语言包、语言界面包、屏幕提示语言或校对包语言。如果所需的校对工具语言、界面或帮助语言不可用，则可能需要获取并安装语言包。有关详细信息，请参阅确定是否需要语言包、语言界面包或校对包或
      Microsoft Office 语言界面包概述。</p>
    <p>若要使用其他语言键入或进行拼写和语法检查，请参阅启用不同语言的键盘布局或检查其他语言的拼写和语法。有关如何设置默认语言和词典的信息，请参阅更改 Office 程序的默认语言。</p>

    <h2>添加编辑语言 </h2>
    <hr />
    <p>编辑语言包含该语言的键盘布局和校对工具。校对工具包括语言特定的功能，例如用于检查拼写和语法的词典或段落方向按钮。</p>
    <ol>
      <li>打开一个 Microsoft Office 程序，如 Word。 </li>
      <li>单击“文件”选项卡。</li>
      <li>在“帮助”下，单击“选项”。 </li>
      <li>单击“语言”。 </li>
      <li>在“设置 Office 语言首选项”对话框中，单击“添加其他编辑语言”箭头，选择要添加的语言，然后单击“添加”。</li>
    </ol>
    <h2>设置默认界面和帮助语言 </h2>
    <hr />
    <p>界面语言和帮助语言是除显示帮助文件时所用的语言之外，Office 2010 中用于显示菜单项、命令和选项卡等元素的语言。</p>
    <ol>
      <li>打开一个 Microsoft Office 程序，如 Word。 </li>
      <li>单击“文件”选项卡。</li>
      <li>在“帮助”下，单击“选项”。 </li>
      <li>单击“语言”。 </li>
      <li>在“设置 Office 语言首选项”对话框中的“选择界面和帮助语言”下，选择要设置为默认语言的语言，然后单击“设为默认值”。 </li>
      <li>更改默认语言后，需要关闭所有的 Office 2010 程序，然后重新打开它们以使更改生效。</li>
      <p>如果由于某种原因，您的默认界面或帮助语言不可用，Microsoft Office 将使用列表中的下一种可用语言。</p>
      <p>如果未列出所需的语言，则可能需要单击“如何从 Office.com 获得其他显示和帮助语言”以添加更多的语言服务。</p>
    </ol>
    <p>设置界面语言和帮助语言的顺序</p>
    <p>语言在界面和帮助列表中出现的顺序就是 Microsoft Office 使用这些语言的顺序。例如，如果您的界面语言顺序是西班牙语 &lt;默认&gt;、德语和日语，但西班牙语工具已从计算机中删除，那么德语将成为您的默认界面语言。 </p>
    <p>您可以让界面语言和帮助语言与操作系统的语言相匹配，也可以对操作系统、界面和帮助分别使用不同的语言。</p>
    <ol>
      <li>在“设置 Office 语言首选项”对话框中的“选择界面和帮助语言”下，单击要设置为默认语言的语言，然后单击箭头，直到该语言出现在列表顶部，并且其名称后面带有“&lt;默认&gt;”字样。</li>
      <p>如果未列出所需的语言，则可能需要单击“如何从 Office.com 获得其他显示和帮助语言”以获得语言包或语言界面包。</p>
      <li>使用向上和向下键设置当某种语言不可用时将使用的语言的顺序。</li>
      <li>更改默认语言后，需要关闭所有的 Office 2010 程序，然后重新打开它们以使更改生效。</li>
    </ol>
  </div>

</div>
</template>
<script>
const styles = [
  {
    cpl: 58,
    lineHeight: 1.2,
    fontSize: 14
  },
  {
    cpl: 58,
    lineHeight: 1.2,
    fontSize: 16
  },
  {
    cpl: 58,
    lineHeight: 1.6,
    fontSize: 14
  },
  {
    cpl: 58,
    lineHeight: 1.6,
    fontSize: 16
  },
  {
    cpl: 78,
    lineHeight: 1.2,
    fontSize: 14
  },
  {
    cpl: 78,
    lineHeight: 1.2,
    fontSize: 16
  },
  {
    cpl: 78,
    lineHeight: 1.6,
    fontSize: 14
  },
  {
    cpl: 78,
    lineHeight: 1.6,
    fontSize: 16
  },
]
import {mapGetters} from 'vuex'
export default {
  props: {
    articleIndex: {
      type: Number,
      default: 0
    },
    demoIndex: {
      type: Number,
      default: 0
    },
  },
  computed: {
    currentStyle() {
      const style = styles[this.demoIndex]
      return {
        fontSize: style.fontSize + 'px',
        lineHeight: style.lineHeight,
        width: style.fontSize * style.cpl + 'px'
      }
    },
  },
}
</script>

<style lang="less">

</style>